RT-Thread/rt-thread/bsp/tm4c129x/libraries/driverlib/rom_map.h
#define MAP_USBULPIEnable                                                     \
        ROM_USBULPIEnable
#else
#define MAP_USBULPIEnable                                                     \
        USBULPIEnable
#endif
#ifdef ROM_USBULPIRegRead
#define MAP_USBULPIRegRead                                                    \
        ROM_USBULPIRegRead
#else
#define MAP_USBULPIRegRead                                                    \
        USBULPIRegRead
#endif
#ifdef ROM_USBULPIRegWrite
#define MAP_USBULPIRegWrite                                                   \
        ROM_USBULPIRegWrite
#else
#define MAP_USBULPIRegWrite                                                   \
        USBULPIRegWrite
#endif
#ifdef ROM_USBOTGSessionRequest
#define MAP_USBOTGSessionRequest                                              \
        ROM_USBOTGSessionRequest
#else
#define MAP_USBOTGSessionRequest                                              \
        USBOTGSessionRequest
#endif
#ifdef ROM_USBDMANumChannels
#define MAP_USBDMANumChannels                                                 \
        ROM_USBDMANumChannels
#else
#define MAP_USBDMANumChannels                                                 \
        USBDMANumChannels
#endif
#ifdef ROM_USBEndpointDMAConfigSet
#define MAP_USBEndpointDMAConfigSet                                           \
        ROM_USBEndpointDMAConfigSet
#else
#define MAP_USBEndpointDMAConfigSet                                           \
        USBEndpointDMAConfigSet
#endif
#ifdef ROM_USBLPMRemoteWakeEnabled
#define MAP_USBLPMRemoteWakeEnabled                                           \
        ROM_USBLPMRemoteWakeEnabled
#else
#define MAP_USBLPMRemoteWakeEnabled                                           \
        USBLPMRemoteWakeEnabled
#endif
#ifdef ROM_USBModeConfig
#define MAP_USBModeConfig                                                     \
        ROM_USBModeConfig
#else
#define MAP_USBModeConfig                                                     \
        USBModeConfig
#endif

//*****************************************************************************
//
// Macros for the Watchdog API.
//
//*****************************************************************************
#ifdef ROM_WatchdogIntClear
#define MAP_WatchdogIntClear                                                  \
        ROM_WatchdogIntClear
#else
#define MAP_WatchdogIntClear                                                  \
        WatchdogIntClear
#endif
#ifdef ROM_WatchdogRunning
#define MAP_WatchdogRunning                                                   \
        ROM_WatchdogRunning
#else
#define MAP_WatchdogRunning                                                   \
        WatchdogRunning
#endif
#ifdef ROM_WatchdogEnable
#define MAP_WatchdogEnable                                                    \
        ROM_WatchdogEnable
#else
#define MAP_WatchdogEnable                                                    \
        WatchdogEnable
#endif
#ifdef ROM_WatchdogResetEnable
#define MAP_WatchdogResetEnable                                               \
        ROM_WatchdogResetEnable
#else
#define MAP_WatchdogResetEnable                                               \
        WatchdogResetEnable
#endif
#ifdef ROM_WatchdogResetDisable
#define MAP_WatchdogResetDisable                                              \
        ROM_WatchdogResetDisable
#else
#define MAP_WatchdogResetDisable                                              \
        WatchdogResetDisable
#endif
#ifdef ROM_WatchdogLock
#define MAP_WatchdogLock                                                      \
        ROM_WatchdogLock
#else
#define MAP_WatchdogLock                                                      \
        WatchdogLock
#endif
#ifdef ROM_WatchdogUnlock
#define MAP_WatchdogUnlock                                                    \
        ROM_WatchdogUnlock
#else
#define MAP_WatchdogUnlock                                                    \
        WatchdogUnlock
#endif
#ifdef ROM_WatchdogLockState
#define MAP_WatchdogLockState                                                 \
        ROM_WatchdogLockState
#else
#define MAP_WatchdogLockState                                                 \
        WatchdogLockState
#endif
#ifdef ROM_WatchdogReloadSet
#define MAP_WatchdogReloadSet                                                 \
        ROM_WatchdogReloadSet
#else
#define MAP_WatchdogReloadSet                                                 \
        WatchdogReloadSet
#endif
#ifdef ROM_WatchdogReloadGet
#define MAP_WatchdogReloadGet                                                 \
        ROM_WatchdogReloadGet
#else
#define MAP_WatchdogReloadGet                                                 \
        WatchdogReloadGet
#endif
#ifdef ROM_WatchdogValueGet
#define MAP_WatchdogValueGet                                                  \
        ROM_WatchdogValueGet
#else
#define MAP_WatchdogValueGet                                                  \
        WatchdogValueGet
#endif
#ifdef ROM_WatchdogIntEnable
#define MAP_WatchdogIntEnable                                                 \
        ROM_WatchdogIntEnable
#else
#define MAP_WatchdogIntEnable                                                 \
        WatchdogIntEnable
#endif
#ifdef ROM_WatchdogIntStatus
#define MAP_WatchdogIntStatus                                                 \
        ROM_WatchdogIntStatus
#else
#define MAP_WatchdogIntStatus                                                 \
        WatchdogIntStatus
#endif
#ifdef ROM_WatchdogStallEnable
#define MAP_WatchdogStallEnable                                               \
        ROM_WatchdogStallEnable
#else
#define MAP_WatchdogStallEnable                                               \
        WatchdogStallEnable
#endif
#ifdef ROM_WatchdogStallDisable
#define MAP_WatchdogStallDisable                                              \
        ROM_WatchdogStallDisable
#else
#define MAP_WatchdogStallDisable                                              \
        WatchdogStallDisable
#endif
#ifdef ROM_WatchdogIntTypeSet
#define MAP_WatchdogIntTypeSet                                                \
        ROM_WatchdogIntTypeSet
#else
#define MAP_WatchdogIntTypeSet                                                \
        WatchdogIntTypeSet
#endif

//*****************************************************************************
//
// Macros for the Software API.
//
//*****************************************************************************
#ifdef ROM_Crc16Array
#define MAP_Crc16Array                                                        \
        ROM_Crc16Array
#else
#define MAP_Crc16Array                                                        \
        Crc16Array
#endif
#ifdef ROM_Crc16Array3
#define MAP_Crc16Array3                                                       \
        ROM_Crc16Array3
#else
#define MAP_Crc16Array3                                                       \
        Crc16Array3
#endif
#ifdef ROM_Crc16
#define MAP_Crc16                                                             \
        ROM_Crc16
#else
#define MAP_Crc16                                                             \
        Crc16
#endif
#ifdef ROM_Crc8CCITT
#define MAP_Crc8CCITT                                                         \
        ROM_Crc8CCITT
#else
#define MAP_Crc8CCITT                                                         \
        Crc8CCITT
#endif
#ifdef ROM_Crc32
#define MAP_Crc32                                                             \
        ROM_Crc32
#else
#define MAP_Crc32                                                             \
        Crc32
#endif

#endif // __DRIVERLIB_ROM_MAP_H__
